#include "STC12C5A60S2.h"
#include <INTRINS.H>
#include "main.h"
#include "lcd.h"
#include "timer.h"
#include "ds18b20.h"
#include "stdio.h"	
#include "pid.h"

/*******************************************************************************
* º¯ÊıÃû         : Ds18b20Init
* º¯Êı¹¦ÄÜ		   : ³õÊ¼»¯
* ÊäÈë           : ÎŞ
* Êä³ö         	 : ³õÊ¼»¯³É¹¦·µ»Ø1£¬Ê§°Ü·µ»Ø0
*******************************************************************************/

unsigned char Ds18b20_Init()
{
	unsigned int i=0;
	DS18B20=0;			 //½«×ÜÏßÀ­µÍ480us~960us	
	 i=1000;
  	while(i>0)i--;
	DS18B20=1;			//È»ºóÀ­¸ß×ÜÏß£¬Èç¹ûDS18B20×ö³ö·´Ó¦»á½«ÔÚ15us~60usºó×ÜÏßÀ­µÍ
	while(DS18B20)	//µÈ´ıDS18B20À­µÍ×ÜÏß
	{
		i++;
		if(i>5000)//µÈ´ı>5MS
			return 0;//³õÊ¼»¯Ê§°Ü	
	}
	return 1;//³õÊ¼»¯³É¹¦
}

/*******************************************************************************
* º¯ÊıÃû         : Ds18b20WriteByte
* º¯Êı¹¦ÄÜ		   : Ïò18B20Ğ´ÈëÒ»¸ö×Ö½Ú
* ÊäÈë           : com
* Êä³ö         	 : ÎŞ
*******************************************************************************/

void Ds18b20_Write_Byte(unsigned char dat)
{ 
	unsigned int i;
	unsigned int j;
	unsigned char testb;
	for(j=0;j<8;j++)
	{
		testb=dat&0x01;
		dat=dat>>1;
	if(testb)     // Ğ´1²¿·Ö
    {
      DS18B20=0;
	  i=15;
	  while(i>0)i--;
      DS18B20=1;
		i=100;
	  while(i>0)i--;
    }
    else
    {
      DS18B20=0;       //Ğ´0²¿·Ö
	 	i=96;
	  while(i>0)i--;
      DS18B20=1;
	  i=15;
	  while(i>0)i--;
    }

	}
}
/*******************************************************************************
* º¯ÊıÃû         : Ds18b20ReadByte
* º¯Êı¹¦ÄÜ		   : ¶ÁÈ¡Ò»¸öÎ»
* ÊäÈë           : com
* Êä³ö         	 : ÎŞ
*******************************************************************************/
unsigned char Ds18b20ReadBit(void)
{

	unsigned char i;
   unsigned char dat;
   DS18B20=0;
	  i=15;
	  while(i>0)i--;
   DS18B20=1;
   i++;i++;
   dat=DS18B20;
  	i=96;
   while(i>0)i--;
   return (dat);
}
/*******************************************************************************
* º¯ÊıÃû         : Ds18b20ReadByte
* º¯Êı¹¦ÄÜ		   : ¶ÁÈ¡Ò»¸ö×Ö½Ú
* ÊäÈë           : com
* Êä³ö         	 : ÎŞ
*******************************************************************************/


unsigned char Ds18b20_Read_Byte()
{
unsigned char i,j,dat;
  dat=0;
  for(i=1;i<=8;i++)
  {
    j=Ds18b20ReadBit();
    dat=(j<<7)|(dat>>1);   //¶Á³öµÄÊı¾İ×îµÍÎ»ÔÚ×îÇ°Ãæ£¬ÕâÑù¸ÕºÃ//Ò»¸ö×Ö½ÚÔÚDATÀï
  }
  return(dat);             //½«Ò»¸ö×Ö½ÚÊı¾İ·µ»Ø
}
/*******************************************************************************
* º¯ÊıÃû         : Ds18b20ChangTemp
* º¯Êı¹¦ÄÜ		   : ÈÃ18b20¿ªÊ¼×ª»»ÎÂ¶È
* ÊäÈë           : com
* Êä³ö         	 : ÎŞ
*******************************************************************************/

void  Ds18b20_start_trans()
{
	Ds18b20_Init();
	Delay1ms(1);
	Ds18b20_Write_Byte(0xcc);		//Ìø¹ıROM²Ù×÷ÃüÁî		 
	Ds18b20_Write_Byte(0x44);	    //ÎÂ¶È×ª»»ÃüÁî
//	Delay1ms(100);	//µÈ´ı×ª»»³É¹¦£¬¶øÈç¹ûÄãÊÇÒ»Ö±Ë¢×ÅµÄ»°£¬¾Í²»ÓÃÕâ¸öÑÓÊ±ÁË
   
}
/*******************************************************************************
* º¯ÊıÃû         : Ds18b20ReadTempCom
* º¯Êı¹¦ÄÜ		   : ·¢ËÍ¶ÁÈ¡ÎÂ¶ÈÃüÁî
* ÊäÈë           : com
* Êä³ö         	 : ÎŞ
*******************************************************************************/

void  Ds18b20_Read_Temp_Com()
{	

	Ds18b20_Init();
	Delay1ms(1);
	Ds18b20_Write_Byte(0xcc);	 //Ìø¹ıROM²Ù×÷ÃüÁî
	Ds18b20_Write_Byte(0xbe);	 //·¢ËÍ¶ÁÈ¡ÎÂ¶ÈÃüÁî
}
/*******************************************************************************
* º¯ÊıÃû         : Ds18b20ReadTemp
* º¯Êı¹¦ÄÜ		   : ¶ÁÈ¡ÎÂ¶È
* ÊäÈë           : com
* Êä³ö         	 : ÎŞ
*******************************************************************************/

int Ds18b20_Read_Temp()
{
	int temp=0;	
	float tp; 
	unsigned char tmh,tml;
	Ds18b20_start_trans();			 	//ÏÈĞ´Èë×ª»»ÃüÁî
	Ds18b20_Read_Temp_Com();			//È»ºóµÈ´ı×ª»»Íêºó·¢ËÍ¶ÁÈ¡ÎÂ¶ÈÃüÁî
	tml=Ds18b20_Read_Byte();			//¶ÁÈ¡ÎÂ¶ÈÖµ¹²16Î»£¬ÏÈ¶ÁµÍ×Ö½Ú
	tmh=Ds18b20_Read_Byte();			//ÔÙ¶Á¸ß×Ö½Ú
	temp=tmh;
	temp<<=8;
	temp|=tml;
	 
	if(temp < 0)						//µ±ÎÂ¶ÈÖµÎª¸ºÊı
  	{
		
		temp=temp-1;						//ÒòÎª¶ÁÈ¡µÄÎÂ¶ÈÊÇÊµ¼ÊÎÂ¶ÈµÄ²¹Âë£¬ËùÒÔ¼õ1£¬ÔÙÈ¡·´Çó³öÔ­Âë
		temp=~temp;
		tp=temp;
		temp=tp*0.0625f*100+0.5f;	
		//ÁôÁ½¸öĞ¡Êıµã¾Í*100£¬+0.5ÊÇËÄÉáÎåÈë£¬ÒòÎªCÓïÑÔ¸¡µãÊı×ª»»ÎªÕûĞÍµÄÊ±ºò°ÑĞ¡Êıµã
		//ºóÃæµÄÊı×Ô¶¯È¥µô£¬²»¹ÜÊÇ·ñ´óÓÚ0.5£¬¶ø+0.5Ö®ºó´óÓÚ0.5µÄ¾ÍÊÇ½ø1ÁË£¬Ğ¡ÓÚ0.5µÄ¾Í
		//ËãÓÉÏ0.5£¬»¹ÊÇÔÚĞ¡ÊıµãºóÃæ¡£
  	}
 	else
  	{			
		tp=temp;//ÒòÎªÊı¾İ´¦ÀíÓĞĞ¡ÊıµãËùÒÔ½«ÎÂ¶È¸³¸øÒ»¸ö¸¡µãĞÍ±äÁ¿									
		temp=tp*0.0625f*100+0.5f;				//Èç¹ûÎÂ¶ÈÊÇÕıµÄÄÇÃ´£¬ÄÇÃ´ÕıÊıµÄÔ­Âë¾ÍÊÇ²¹ÂëËü±¾Éí
		//ÁôÁ½¸öĞ¡Êıµã¾Í*100£¬+0.5ÊÇËÄÉáÎåÈë£¬ÒòÎªCÓïÑÔ¸¡µãÊı×ª»»ÎªÕûĞÍµÄÊ±ºò°ÑĞ¡Êıµã
		//ºóÃæµÄÊı×Ô¶¯È¥µô£¬²»¹ÜÊÇ·ñ´óÓÚ0.5£¬¶ø+0.5Ö®ºó´óÓÚ0.5µÄ¾ÍÊÇ½ø1ÁË£¬Ğ¡ÓÚ0.5µÄ¾Í
		//Ëã¼ÓÉÏ0.5£¬»¹ÊÇÔÚĞ¡ÊıµãºóÃæ¡£
	}
	return temp;
}

//void read_temperature()
//{
//	if(ds18b20count>=5)
//	{
//	   	ds18b20count=0;
//		T_ds18b20_new=Ds18b20_Read_Temp();				//¶ÁÈ¡ÎÂ¶ÈÖµ	
//	}
//}